function torq = p560_idyn(q,qv,qa,he)
%PUMA560机械臂逆向动力学
%   torq: 关节力矩
%   q: 关节位置
%   qv: 关节速度
%   qa: 关节加速度
%   he: 末端负载，he=[F,mu]'

% 连杆质量
m = [0.2645,0.17,0.1705,0,0,0];
% 连杆惯量矩阵
I = cat(3,diag([1.542,0,1.542]*1e-3),diag([0,0.409,0.409]*1e-3),diag([0.413,0.413,0]*1e-3),...
    3*eye(3),2*eye(3),1*eye(3));
% 连杆质心位置
% i坐标系原点->i质心
r_i_ci = [0,-8.5,0,0,0,0;13.225,0,0,0,0,0;0,3.7,8.525,0,0,0]*1e-2;

%%
% 齐次变换矩阵
T01 = [cos(q(1)),0,-sin(q(1)),0
    sin(q(1)),0,cos(q(1)),0
    0,-1,0,26.45e-2
    0,0,0,1];
T12 = [cos(q(2)),-sin(q(2)),0,17e-2*cos(q(2))
    sin(q(2)),cos(q(2)),0,17e-2*sin(q(2))
    0,0,1,5.5e-2
    0,0,0,1];
T23 = [cos(q(3)),0,-sin(q(3)),0
    sin(q(3)),0,cos(q(3)),0
    0,-1,0,0
    0,0,0,1];
T34 = [cos(q(4)),0,sin(q(4)),0
    sin(q(4)),0,-cos(q(4)),0
    0,1,0,17.05e-2
    0,0,0,1];
T45 = [cos(q(5)),0,-sin(q(5)),0
    sin(q(5)),0,cos(q(5)),0
    0,-1,0,0
    0,0,0,1];
T56 = [cos(q(6)),-sin(q(6)),0,0
    sin(q(6)),cos(q(6)),0,0
    0,0,1,0
    0,0,0,1];
% T_i-1_i
T_i1_i = cat(3,T01,T12,T23,T34,T45,T56);
% T_0_i-1
T_0_i1 = cat(3,eye(4),T_i1_i);
for i = 1:6
    T_0_i1(:,:,i+1) = T_0_i1(:,:,i)*T_i1_i(:,:,i);
end
% T_0_i
T_0_i =  T_0_i1(:,:,2:end);
% R_0_i-1
R_0_i1 = T_0_i1(1:3,1:3,:);
% R_0_i
R_0_i = T_0_i(1:3,1:3,:);
% R_i-1_i
R_i1_i = T_i1_i(1:3,1:3,:);
% P_i-1_i
P_i1_i = T_i1_i(1:3,4,:);

% i-1坐标系原点->i质心
% r_i1_ci = [0,8.5,0,0,0,0;-13.225,0,0,17.05,0,0;0,9.2,8.525,0,0,0]*1e-2;
r_i1_ci = zeros(3,6);
for i = 1:6
    r_i1_ci(:,i) = R_i1_i(:,:,i)'*P_i1_i(:,:,i)+r_i_ci(:,i);
end

%%
% 正向递推计算连杆运动轨迹
% *(:,i+1)对应下标i (i=0...6)
w = zeros(3,7); % 角速度
b = zeros(3,7); % 角加速度
p = zeros(3,7); % 位置
v = zeros(3,7); % 速度
a = zeros(3,7); % 加速度
ac = zeros(3,7); % 质心加速度
for i = 1:6   
    w(:,i+1) = w(:,i)+qv(i)*R_0_i1(:,:,i)*[0,0,1]';
    b(:,i+1) = b(:,i)+cross(w(:,i),qv(i)*R_0_i1(:,:,i)*[0,0,1]')+qa(i)*R_0_i1(:,:,i)*[0,0,1]';
    p(:,i+1) = T_0_i(1:3,4,i);
    v(:,i+1) = v(:,i)+cross(w(:,i+1),p(:,i+1)-p(:,i));
    a(:,i+1) = a(:,i)+cross(b(:,i+1),p(:,i+1)-p(:,i))+cross(w(:,i+1),cross(w(:,i+1),p(:,i+1)-p(:,i)));
    ac(:,i+1) = a(:,i+1)+cross(b(:,i+1),R_0_i(:,:,i)*r_i_ci(:,i))+...
        cross(w(:,i+1),cross(w(:,i+1),R_0_i(:,:,i)*r_i_ci(:,i)));
end
% 取2:7列使i与下标对应
w = w(:,2:end);
b = b(:,2:end);
p = p(:,2:end);
v = v(:,2:end);
a = a(:,2:end);
ac = ac(:,2:end);

%%
% 逆向递推
f = zeros(3,7); % 力
mu = zeros(3,7); % 力矩
f(:,7) = he(1:3,:); % 末端负载力
mu(:,7) = he(4:6,:); % 末端负载力矩
torq = zeros(1,6); % 关节力矩
for i = 6:-1:1
    f(:,i) = f(:,i+1)+m(i)*ac(:,i)-m(i)*9.81*[0,0,-1]';
    mu(:,i) = mu(:,i+1)+cross(f(:,i+1),R_0_i(:,:,i)*r_i_ci(:,i))-...
        cross(f(:,i),R_0_i(:,:,i)*r_i1_ci(:,i))+R_0_i(:,:,i)*I(:,:,i)*R_0_i(:,:,i)'*b(:,i)+...
        cross(w(:,i),R_0_i(:,:,i)*I(:,:,i)*R_0_i(:,:,i)'*w(:,i));
    torq(i) = mu(:,i)'*(R_0_i1(:,:,i)*[0,0,1]');
end

end

